---
kind: enumMember
id: F:Autodesk.Revit.DB.CompoundStructureError.MembraneTooThick
enum: Autodesk.Revit.DB.CompoundStructureError
source: html/8e8457e0-84c4-ccb1-114c-fa25a6d37fed.htm
---
# Autodesk.Revit.DB.CompoundStructureError.MembraneTooThick

Thickness of membrane layer is more than zero.